app/views/tracks/_form.html.erb

    <%= f.label :album_id %><br>
    <%= f.select :album_id, Album.all.collect {|p| [ p.album_name, p.id ] }, { include_blank: true } %> <!--не в курил до конца но работает-->
---
SELECT "albums".* FROM "albums"