app/views/tracks/index.html.erb

SELECT "tracks".* FROM "tracks" WHERE "tracks"."album_id" = 2
---

<% sort_track = Track.where(album_id: 2) %>