app/views/albums/index.html.erb


<% track = Track.find(5) %>
---
SELECT "tracks".* FROM "tracks" WHERE "tracks"."id" = ? LIMIT 1  [["id", 2]]