app/controllers/albums_controller.rb

  def index
    @albums = Album.all
---
SELECT "albums".* FROM "albums" WHERE (album_name like '%Новый Альбом%') ORDER BY created_at DESC

  def show
    @tracks = Track.where(album_id: @album.id)
---
SELECT "tracks".* FROM "tracks" WHERE "tracks"."album_id" = 15

  def create
    @album = Album.new(album_params)

    respond_to do |format|
      if @album.save
---
INSERT INTO "albums" ("albume_name", "created_at", "updated_at") VALUES (?, ?, ?)  [["albume_name", "2105"], ["created_at", Mon, 30 Nov 2015 21:39:24 UTC +00:00], ["updated_at", Mon, 30 Nov 2015 21:39:24 UTC +00:00]]

  def update
    respond_to do |format|
      if @album.update(album_params)
---
UPDATE "albums" SET "album_name" = ?, "updated_at" = ? WHERE "albums"."id" = 2  [["album_name", "new 2015 album for me"], ["updated_at", Mon, 30 Nov 2015 22:09:28 UTC +00:00]]

  def destroy
    @tracks = Track.where(album_id: @album.id)  #destroy all tracks if they connected to Album
    @tracks.each do |track|
      track.destroy
    end
    @album.destroy
---
SELECT "tracks".* FROM "tracks" WHERE "tracks"."album_id" = 19
DELETE FROM "tracks" WHERE "tracks"."id" = ?  [["id", 13]]
DELETE FROM "albums" WHERE "albums"."id" = ?  [["id", 2]]