app/controllers/tracks_controller.rb

  def index
    @tracks = Track.all
---
SELECT "tracks".* FROM "tracks" WHERE (record_name || autor_name like '%Nickelback%') ORDER BY created_at DESC

  def show
      unless @track.album_id
      @album_name = "\"Don't assigned or doesn't belong to any album \""
    else
      @album_name = Album.find(@track.album_id).album_name
---
SELECT "albums".* FROM "albums" WHERE "albums"."id" = ? LIMIT 1  [["id", 4]]

  def create
    @track = Track.new(track_params)

    respond_to do |format|
      if @track.save
---
INSERT INTO "tracks" ("album_id", "autor_name", "created_at", "record_name", "updated_at") VALUES (?, ?, ?, ?, ?)  [["album_id", 1], ["autor_name", "dhf"], ["created_at", Sun, 29 Nov 2015 20:29:00 UTC +00:00], ["record_name", "dfh"], ["updated_at", Sun, 29 Nov 2015 20:29:00 UTC +00:00]]

  def update
    respond_to do |format|
      if @track.update(track_params)
---
UPDATE "tracks" SET "record_name" = ?, "updated_at" = ? WHERE "tracks"."id" = 24  [["record_name", "Any Track"], ["updated_at", Wed, 23 Dec 2015 22:13:53 UTC +00:00]]

  def destroy
    @track.destroy
---
DELETE FROM "tracks" WHERE "tracks"."id" = ?  [["id", 1]]